src/Catalogs/StandardAttributes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>StandardAttributes</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Catalogs</xr:Item>
				<xr:Item>Catalog.AccountingRegisters</xr:Item>
				<xr:Item>Catalog.AccumulationRegisters</xr:Item>
				<xr:Item>Catalog.ChartsOfCharacteristicTypes</xr:Item>
				<xr:Item>Catalog.Documents</xr:Item>
				<xr:Item>Catalog.InformationRegisters</xr:Item>
				<xr:Item>Catalog.ChartsOfAccounts</xr:Item>
				<xr:Item>Catalog.BusinessProcesses</xr:Item>
				<xr:Item>Catalog.CalculationRegisters</xr:Item>
				<xr:Item>Catalog.ChartsOfCalculationTypes</xr:Item>
				<xr:Item>Catalog.ExchangePlans</xr:Item>
				<xr:Item>Catalog.TabularSections</xr:Item>
				<xr:Item>Catalog.Tasks</xr:Item>
				<xr:Item>Catalog.Recalculations</xr:Item>
				<xr:Item>Catalog.Enums</xr:Item>
				<xr:Item>Catalog.DocumentJournals</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Deleted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChoiceForm</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Forms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChoiceHistoryOnInput</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ChoiceHistoryOnInput</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChoiceParameterLinks</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ChoiceParameterLinks</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChoiceParameters</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ChoiceParameters</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Config</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Configurations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreateOnInput</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CreateOnInput</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExtendedEdit</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FillChecking</Name>
					<Type>
						<v8:Type>cfg:EnumRef.FillChecking</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FillFromFillingValue</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FillValue</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Values</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Format</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LocaleStrings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FullTextSearch</Name>
					<Type>
						<v8:Type>cfg:EnumRef.FullTextSearchUsing</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MarkNegatives</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Mask</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MaxValue</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Values</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MinValue</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Values</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MultiLine</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PasswordMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>QuickChoice</Name>
					<Type>
						<v8:Type>cfg:EnumRef.UseQuickChoice</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Synonym</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LocaleStrings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ToolTip</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LocaleStrings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/StandardAttributes/Ext/ManagerModule.bsl
Function Load(Context, Data) Export
	Var Object;
	
	Config = Context.Config;
	Owner  = Context.Owner;
	Cache  = Context.Cache;
	
	// precondition:
	// # (Config == Owner.Owner)
	
	This = Catalogs.StandardAttributes;
	MetaName = "StandardAttribute"; 
	
	Properties = Data;
	Name = Properties.Name;
		
	CacheItem = Meta.CacheItem(Cache, MetaName, New Structure("Owner, Name", Owner, Name));
	
	BeginTransaction();
	
	If Not ValueIsFilled(CacheItem.Ref) Then
		Object = This.CreateItem();
		CacheItem.Ref = This.GetRef();
		Object.SetNewObjectRef(CacheItem.Ref);
	Else
		Object = CacheItem.Ref.GetObject();
	EndIf;  
	
	// Cached fields  
		
	FillPropertyValues(Object, CacheItem, CachedFields());
	
	// Properties
	
	Object.Config = Config;
	
	Abc.Fill(Object, Properties, Abc.Lines(
		"ChoiceHistoryOnInput"
		"Comment"
		"CreateOnInput"
		"ExtendedEdit"
		"FillChecking"
		"FillFromFillingValue"
		"FullTextSearch"
		"MarkNegatives"
		"Mask"
		"MultiLine"
		"PasswordMode"
		"QuickChoice"
	)); 
	
	Meta.UpdateStrings(Config, CacheItem.Ref, Object, Properties, Abc.Lines(
	    "Synonym"
		"Format"
		"ToolTip"
	));
		
	Object.Write();	
	
	CommitTransaction();
	
	Return CacheItem.Ref;
	
EndFunction // Load()

Function CachedFields() Export
	
	Return "Name, Owner";
	
EndFunction // CachedFields()

Function Cache(Config) Export
	
	Query = New Query;
	Query.SetParameter("Config", Config);
	Query.Text = StrTemplate(
		"SELECT Ref, %1
		|FROM Catalog.StandardAttributes
		|WHERE
		|	Config = &Config AND NOT Deleted",
		CachedFields()
	);
	
	Table = Query.Execute().Unload();
	
	Table.Columns.Add("Mark", New TypeDescription("Boolean"));
	
	Return Table;
	
EndFunction // Cache()
